app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "location", "first_name", "last_name", "county", "cell_number", "transportation", "age", "zip_code", "hero", "volunteer", "babysitting", "grocery_shopping", "e_learning_assistance", "sunday", "monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "morning", "afternoon", "evening", "night", "other", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29) RETURNING "id"
---
  def create
    @user = User.create(user_params)